ChibiOS/ChibiOS/os/hal/ports/STM32/STM32G4xx/hal_lld.h
/*
    ChibiOS - Copyright (C) 2006..2018 Giovanni Di Sirio

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    STM32G4xx/hal_lld.h
 * @brief   STM32G4xx HAL subsystem low level driver header.
 * @pre     This module requires the following macros to be defined in the
 *          @p board.h file:
 *          - STM32_LSECLK.
 *          - STM32_LSEDRV.
 *          - STM32_LSE_BYPASS (optionally).
 *          - STM32_HSECLK.
 *          - STM32_HSE_BYPASS (optionally).
 *          .
 *          One of the following macros must also be defined:
 *          - STM32G431xx, STM32G441xx, STM32G471xx.
 *          - STM32G473xx, STM32G483xx.
 *          - STM32G474xx, STM32G484xx.
 *          - STM32GBK1CB.
 *          .
 *
 * @addtogroup HAL
 * @{
 */

#ifndef HAL_LLD_H
#define HAL_LLD_H

#include "stm32_registry.h"

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @name    Platform identification
 * @{
 */
#if defined(STM32G431xx) || defined(STM32G441xx) || defined(STM32G471xx) || \
    defined(__DOXYGEN__)
#define PLATFORM_NAME           "STM32G04 Access Line"

#elif defined(STM32G473xx)
#define PLATFORM_NAME           "STM32G0 Performance Line"

#elif defined(STM32G483xx)
#define PLATFORM_NAME           "STM32G0 Performance Line with Crypto"

#elif defined(STM32G474xx)
#define PLATFORM_NAME           "STM32G4 Hi-resolution Line"

#elif defined(STM32G484xx)
#define PLATFORM_NAME           "STM32G4 Hi-resolution Line with Crypto"

#elif defined(STM32GBK1CB)
#define PLATFORM_NAME           "STM32G4 Mystery Line"

#else
#error "STM32G4 device not specified"
#endif

/**
 * @brief   Sub-family identifier.
 */
#if !defined(STM32G4XX) || defined(__DOXYGEN__)
#define STM32G4XX
#endif
/** @} */

/**
 * @name    Internal clock sources
 * @{
 */
#define STM32_HSI16CLK          16000000U   /**< 16MHz internal clock.      */
#define STM32_HSI48CLK          48000000U   /**< 48MHz internal clock.      */
#define STM32_LSICLK            32000U      /**< Low speed internal clock.  */
/** @} */

/**
 * @name    PWR_CR1 register bits definitions
 * @{
 */
#define STM32_VOS_MASK          (3U << 9U)  /**< Core voltage mask.         */
#define STM32_VOS_RANGE1        (1U << 9U)  /**< Core voltage 1.2 Volts.    */
#define STM32_VOS_RANGE2        (2U << 9U)  /**< Core voltage 1.0 Volts.    */
/** @} */

/**
 * @name    PWR_CR2 register bits definitions
 * @{
 */
#define STM32_PVDE_DISABLED     (0U << 1U)      /**< PVD enable bit off.    */
#define STM32_PVDE_ENABLED      (1U << 1U)      /**< PVD enable bit on.     */

#define STM32_PLS_MASK          (7U << 1U)      /**< PLS bits mask.         */
#define STM32_PLS(n)            ((n) << 1U)     /**< PLS level.             */
#define STM32_PLS_LEV0          STM32_PLS(0U)   /**< PLS level 0.           */
#define STM32_PLS_LEV1          STM32_PLS(1U)   /**< PLS level 1.           */
#define STM32_PLS_LEV2          STM32_PLS(2U)   /**< PLS level 2.           */
#define STM32_PLS_LEV3          STM32_PLS(3U)   /**< PLS level 3.           */
#define STM32_PLS_LEV4          STM32_PLS(4U)   /**< PLS level 4.           */
#define STM32_PLS_LEV5          STM32_PLS(5U)   /**< PLS level 5.           */
#define STM32_PLS_LEV6          STM32_PLS(6U)   /**< PLS level 6.           */
#define STM32_PLS_LEV7          STM32_PLS(7U)   /**< PLS level 7.           */

#define STM32_PVMEN1_DISABLED   (0U << 6U)      /**< PVMEN1 enable bit off. */
#define STM32_PVMEN1_ENABLED    (1U << 6U)      /**< PVMEN1 enable bit on.  */

#define STM32_PVMEN2_DISABLED   (0U << 7U)      /**< PVMEN2 enable bit off. */
#define STM32_PVMEN2_ENABLED    (1U << 7U)      /**< PVMEN2 enable bit on.  */
/** @} */

/**
 * @name    RCC_CR register bits definitions
 * @{
 */
/** @} */

/**
 * @name    RCC_CFGR register bits definitions
 * @{
 */
#define STM32_SW_MASK           (3U << 0U)  /**< SW field mask.             */
#define STM32_SW_HSI16          (1U << 0U)  /**< SYSCLK source is HSI16.    */
#define STM32_SW_HSE            (2U << 0U)  /**< SYSCLK source is HSE.      */
#define STM32_SW_PLLRCLK        (3U << 0U)  /**< SYSCLK source is PLL.      */

#define STM32_HPRE_MASK         (15U << 4U) /**< HPRE field mask.           */
#define STM32_HPRE_FIELD(n)     ((n) << 4U) /**< HPRE field value.          */
#define STM32_HPRE_DIV1         STM32_HPRE_FIELD(0U)
#define STM32_HPRE_DIV2         STM32_HPRE_FIELD(8U)
#define STM32_HPRE_DIV4         STM32_HPRE_FIELD(9U)
#define STM32_HPRE_DIV8         STM32_HPRE_FIELD(10U)
#define STM32_HPRE_DIV16        STM32_HPRE_FIELD(11U)
#define STM32_HPRE_DIV64        STM32_HPRE_FIELD(12U)
#define STM32_HPRE_DIV128       STM32_HPRE_FIELD(13U)
#define STM32_HPRE_DIV256       STM32_HPRE_FIELD(14U)
#define STM32_HPRE_DIV512       STM32_HPRE_FIELD(15U)

#define STM32_PPRE1_MASK        (7U << 7U)   /**< PPRE1 field mask.         */
#define STM32_PPRE1_FIELD(n)    ((n) << 7U)  /**< PPRE1 field value.        */
#define STM32_PPRE1_DIV1        STM32_PPRE1_FIELD(0U)
#define STM32_PPRE1_DIV2        STM32_PPRE1_FIELD(4U)
#define STM32_PPRE1_DIV4        STM32_PPRE1_FIELD(5U)
#define STM32_PPRE1_DIV8        STM32_PPRE1_FIELD(6U)
#define STM32_PPRE1_DIV16       STM32_PPRE1_FIELD(7U)

#define STM32_PPRE2_MASK        (7U << 12U)  /**< PPRE2 field mask.         */
#define STM32_PPRE2_FIELD(n)    ((n) << 12U) /**< PPRE2 field value.        */
#define STM32_PPRE2_DIV1        STM32_PPRE1_FIELD(0U)
#define STM32_PPRE2_DIV2        STM32_PPRE1_FIELD(4U)
#define STM32_PPRE2_DIV4        STM32_PPRE1_FIELD(5U)
#define STM32_PPRE2_DIV8        STM32_PPRE1_FIELD(6U)
#define STM32_PPRE2_DIV16       STM32_PPRE1_FIELD(7U)

